jwt_auth/src/InformationRegisters/ПолитикиДоступаОпераций/ПолитикиДоступаОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолитикиДоступаОпераций</name>
  <resources>
    <name>ТребуемаяОбласть</name>
    <type>
      <types>CatalogRef.ОбластиДоступа</types>
    </type>
  </resources>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

jwt_auth/src/InformationRegisters/ПолитикиДоступаОпераций/ManagerModule.bsl
Функция ОбластиПоОперации(Операция) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолитикиДоступаОпераций.ТребуемаяОбласть.Идентификатор КАК ТребуемаяОбласть
		|ИЗ
		|	РегистрСведений.ПолитикиДоступаОпераций КАК ПолитикиДоступаОпераций
		|ГДЕ
		|	ПолитикиДоступаОпераций.Операция = &Операция";
	
	Запрос.УстановитьПараметр("Операция", Операция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Области = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Области.Добавить(Выборка.ТребуемаяОбласть);
	КонецЦикла;
	
	Возврат Области;
КонецФункции
